GreatCowBASIC/DATFileGenerator/incfiles/p16F15223.inc
;----- WPUC Bits -----------------------------------------------------
WPUC0            EQU  H'0000'
WPUC1            EQU  H'0001'
WPUC2            EQU  H'0002'
WPUC3            EQU  H'0003'
WPUC4            EQU  H'0004'
WPUC5            EQU  H'0005'


;----- ODCONC Bits -----------------------------------------------------
ODCC0            EQU  H'0000'
ODCC1            EQU  H'0001'
ODCC2            EQU  H'0002'
ODCC3            EQU  H'0003'
ODCC4            EQU  H'0004'
ODCC5            EQU  H'0005'


;----- SLRCONC Bits -----------------------------------------------------
SLRC0            EQU  H'0000'
SLRC1            EQU  H'0001'
SLRC2            EQU  H'0002'
SLRC3            EQU  H'0003'
SLRC4            EQU  H'0004'
SLRC5            EQU  H'0005'


;----- INLVLC Bits -----------------------------------------------------
INLVLC0          EQU  H'0000'
INLVLC1          EQU  H'0001'
INLVLC2          EQU  H'0002'
INLVLC3          EQU  H'0003'
INLVLC4          EQU  H'0004'
INLVLC5          EQU  H'0005'


;----- IOCCP Bits -----------------------------------------------------
IOCCP0           EQU  H'0000'
IOCCP1           EQU  H'0001'
IOCCP2           EQU  H'0002'
IOCCP3           EQU  H'0003'
IOCCP4           EQU  H'0004'
IOCCP5           EQU  H'0005'


;----- IOCCN Bits -----------------------------------------------------
IOCCN0           EQU  H'0000'
IOCCN1           EQU  H'0001'
IOCCN2           EQU  H'0002'
IOCCN3           EQU  H'0003'
IOCCN4           EQU  H'0004'
IOCCN5           EQU  H'0005'


;----- IOCCF Bits -----------------------------------------------------
IOCCF0           EQU  H'0000'
IOCCF1           EQU  H'0001'
IOCCF2           EQU  H'0002'
IOCCF3           EQU  H'0003'
IOCCF4           EQU  H'0004'
IOCCF5           EQU  H'0005'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'


;----- TOSL Bits -----------------------------------------------------
TOSL0            EQU  H'0000'
TOSL1            EQU  H'0001'
TOSL2            EQU  H'0002'
TOSL3            EQU  H'0003'
TOSL4            EQU  H'0004'
TOSL5            EQU  H'0005'
TOSL6            EQU  H'0006'
TOSL7            EQU  H'0007'


;----- TOSH Bits -----------------------------------------------------
TOSH0            EQU  H'0000'
TOSH1            EQU  H'0001'
TOSH2            EQU  H'0002'
TOSH3            EQU  H'0003'
TOSH4            EQU  H'0004'
TOSH5            EQU  H'0005'
TOSH6            EQU  H'0006'
TOSH7            EQU  H'0007'

;==========================================================================
;
;       RAM Definitions
;
;==========================================================================

       __MAXRAM  H'07FF'
       __BADRAM  H'000E'
       __BADRAM  H'000F'-H'0011'
       __BADRAM  H'0013'
       __BADRAM  H'0015'-H'0017'
       __BADRAM  H'0019'
       __BADRAM  H'001B'-H'001F'
       __BADRAM  H'008C'-H'0099'
       __BADRAM  H'010C'-H'010D'
       __BADRAM  H'0110'-H'0118'
       __BADRAM  H'0193'-H'019F'
       __BADRAM  H'0212'-H'021F'
       __BADRAM  H'0292'-H'029F'
       __BADRAM  H'0317'
       __BADRAM  H'031B'-H'031F'
       __BADRAM  H'038C'-H'039F'
       __BADRAM  H'040C'-H'041F'
       __BADRAM  H'048C'-H'049F'
       __BADRAM  H'050C'-H'051F'
       __BADRAM  H'058C'-H'059B'
       __BADRAM  H'060C'-H'061F'
       __BADRAM  H'068C'-H'069F'
       __BADRAM  H'070F'-H'0715'
       __BADRAM  H'0719'-H'071F'
       __BADRAM  H'078C'-H'079F'
       __BADRAM  H'080E'-H'0811'
       __BADRAM  H'0812'
       __BADRAM  H'0815'-H'0819'
       __BADRAM  H'088C'-H'088D'
       __BADRAM  H'088F'
       __BADRAM  H'0894'-H'089F'
       __BADRAM  H'090E'-H'0920'
       __BADRAM  H'098C'-H'099F'
       __BADRAM  H'0A0C'-H'0A1F'
       __BADRAM  H'0A8C'-H'0A9F'
       __BADRAM  H'0B0C'-H'0B1F'
       __BADRAM  H'0B8C'-H'0B9F'
       __BADRAM  H'0C0C'-H'0C1F'
       __BADRAM  H'0C8C'-H'0C9F'
       __BADRAM  H'0E0C'-H'0E1F'
       __BADRAM  H'0E8C'-H'0E9F'
       __BADRAM  H'0E0C'-H'0E1F'
       __BADRAM  H'0E8C'-H'0E9F'
       __BADRAM  H'0F0C'-H'0F1F'
       __BADRAM  H'0F8C'-H'0F9F'
       __BADRAM  H'100C'-H'101F'
       __BADRAM  H'108C'-H'109F'
       __BADRAM  H'110C'-H'111F'
       __BADRAM  H'118C'-H'119F'
       __BADRAM  H'120C'-H'121F'
       __BADRAM  H'128C'-H'129F'
       __BADRAM  H'130C'-H'131F'
       __BADRAM  H'138C'-H'139F'
       __BADRAM  H'140C'-H'141F'
       __BADRAM  H'148C'-H'149F'
       __BADRAM  H'150C'-H'151F'
       __BADRAM  H'158C'-H'159F'
       __BADRAM  H'160C'-H'161F'
       __BADRAM  H'168C'-H'169F'
       __BADRAM  H'170C'-H'171F'
       __BADRAM  H'178C'-H'179F'
       __BADRAM  H'180C'-H'181F'
       __BADRAM  H'188C'-H'189F'
       __BADRAM  H'190C'-H'191F'
       __BADRAM  H'198C'-H'199F'
       __BADRAM  H'1A0C'-H'1A1F'
       __BADRAM  H'1A8C'-H'1A9F'
       __BADRAM  H'1B0C'-H'1B1F'
       __BADRAM  H'1B8C'-H'1B9F'
       __BADRAM  H'1C0C'-H'1C1F'
       __BADRAM  H'1C8C'-H'1C9F'
       __BADRAM  H'1E0C'-H'1E1F'
       __BADRAM  H'1E8C'-H'1EEF'
       __BADRAM  H'1E0C'-H'1E6F'
       __BADRAM  H'1E8C'-H'1E8E'
       __BADRAM  H'1E94'-H'1E9B'
       __BADRAM  H'1E9E'-H'1EA1'
       __BADRAM  H'1EA3'-H'1EC2'
       __BADRAM  H'1EC4'
       __BADRAM  H'1EC8'-H'1ECA'
       __BADRAM  H'1ECE'-H'1EF0'
       __BADRAM  H'1F0C'-H'1F0F'
       __BADRAM  H'1F13'
       __BADRAM  H'1F16'-H'1F1F'
       __BADRAM  H'1F26'-H'1F37'
       __BADRAM  H'1F40'-H'1F4D'
       __BADRAM  H'1F56'-H'1F6F'
       __BADRAM  H'1F8C'-H'1FB7'
       __BADRAM  H'1FB8'-H'1FE3'
       __BADRAM  H'1FEC'


;==========================================================================
; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1      EQU  H'8007'
_CONFIG2      EQU  H'8008'
_CONFIG3      EQU  H'8009'
_CONFIG4      EQU  H'800A'
_CONFIG5      EQU  H'800B'
;==========================================================================
             ; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.8.149\xc8\pic\dat\cfgdata\16F15223.cfgdata
;==========================================================================

;----- CONFIG1 Options --------------------------------------------------
_FEXTOSC_ECH         EQU  H'3FFF'; EC (external clock) 16 MHz and above
_FEXTOSC_ECL         EQU  H'3FFE'; EC (external clock) below 16MHz
_FEXTOSC_OFF         EQU  H'3FFD'; Oscillator not enabled
_RSTOSC_EXTOSC       EQU  H'3FFF'; EXTOSC operating per FEXTOSC bits
_RSTOSC_HFINTOSC_1MHZ EQU  H'3FEF'; HFINTOSC (1 MHz)
_RSTOSC_LFINTOSC     EQU  H'3FDF'; LFINTOSC
_RSTOSC_HFINTOSC_32MHZ EQU  H'3FCF'; HFINTOSC (32 MHz)
_CLKOUTEN_ON         EQU  H'3EFF'; CLKOUT function is enabled; FOSC/4 clock appears on RA4
_CLKOUTEN_OFF        EQU  H'3FFF'; CLKOUT function is disabled; I/O function on RA4
_VDDAR_HI            EQU  H'3FFF'; Internal analog systems are calibrated for operation between VDD = 2.3V - 5.5V
_VDDAR_LO            EQU  H'2FFF'; Internal analog systems are calibrated for operation between VDD = 1.8V - 3.6V

;----- CONFIG2 Options --------------------------------------------------
_MCLRE_EXTMCLR       EQU  H'3FFF'; If LVP = 0, MCLR pin is MCLR; If LVP = 1, RA3 pin function is MCLR
_MCLRE_INTMCLR       EQU  H'3FFE'; If LVP = 0, MCLR pin is port defined function; If LVP = 1, RA3 pin function is MCLR
_PWRTS_PWRT_OFF      EQU  H'3FFF'; PWRT is disabled
_PWRTS_PWRT_64       EQU  H'3FFD'; PWRT set at 64 ms
_PWRTS_PWRT_16       EQU  H'3FFB'; PWRT set at 16 ms
_PWRTS_PWRT_1        EQU  H'3FF9'; PWRT set at 1 ms
_WDTE_ON             EQU  H'3FFF'; WDT enabled regardless of Sleep; SEN bit is ignored
_WDTE_NSLEEP         EQU  H'3FF7'; WDT enabled while Sleep = 0, suspended when Sleep = 1; SEN is ignored
_WDTE_SWDTEN         EQU  H'3FEF'; WDT enabled/disabled by SEN bit
_WDTE_OFF            EQU  H'3FE7'; WDT disabled; SEN is ignored
_BOREN_ON            EQU  H'3FFF'; Brown-out Reset Enabled, SBOREN bit is ignored
_BOREN_NSLEEP        EQU  H'3FBF'; Brown-out Reset enabled while running, disabled in Sleep; SBOREN is ignored
_BOREN_SBOREN        EQU  H'3F7F'; Brown-out Reset enabled according to SBOREN bit
_BOREN_OFF           EQU  H'3F3F'; Brown-out Reset disabled
_BORV_LO             EQU  H'3FFF'; Brown-out Reset Voltage (VBOR) set to 1.9V
_BORV_HI             EQU  H'3DFF'; Brown-out Reset Voltage (VBOR) is set to 2.85V
_PPS1WAY_ON          EQU  H'3FFF'; The PPSLOCKED bit can be set once after an unlocking sequence is executed; once PPSLOCKED is set, all future changes to PPS registers are prevented
_PPS1WAY_OFF         EQU  H'37FF'; The PPSLOCKED bit can be set and cleared as needed (unlocking sequence is required)
_STVREN_ON           EQU  H'3FFF'; Stack Overflow or Underflow will cause a reset
_STVREN_OFF          EQU  H'2FFF'; Stack Overflow or Underflow will not cause a reset

;----- CONFIG3 Options --------------------------------------------------

